# BuildingCurveGstyle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BuildingCurveGstyle Property
ParameterTypeId Class See Also
---
"Line Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BuildingCurveGstyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingCurveGstyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BuildingCurveGstyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace